Revit 2027 API
Wall.CurtainGrid Property
 Get the grid object of a curtain wall
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurtainGrid CurtainGrid { get; }
Public ReadOnly Property CurtainGrid As CurtainGrid
	Get
public:
property CurtainGrid^ CurtainGrid {
	CurtainGrid^ get ();
}
member CurtainGrid : CurtainGrid with get
Property Value
CurtainGrid
Remarks
 This property is readonly.
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace